Revit 2026 API

# ContourSetting Class

---

Contour setting object that handles the contour information used to draw contours on elements.

SystemObject Autodesk.Revit.DBContourSetting

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ContourSetting : IDisposable
```
```vb
Public Class ContourSetting
	Implements IDisposable
```
```cpp
public ref class ContourSetting : IDisposable
```
```fsharp
type ContourSetting =
    class
        interface IDisposable
    end
```

The ContourSetting type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | AddContourRange | Add a set of contours as a contour setting item to the current contour setting. |
|  | AddSingleContour | Add a single contour as a contour setting item to the current contour setting. |
|  | DisableItem | Disable a contour setting item of the current contour setting so that the item will not be used to draw contours. |
|  | Dispose | Releases all resources used by the ContourSetting |
|  | EnableItem | Enable a contour setting item of the current contour setting so that the item will be used to draw contours. |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetContourSettingItems | Get all contour setting items. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetItemIndex | Get the index of a contour setting item of the current contour setting |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsItemEnabled | Check if a ContourSettingItem is enabled |
|  | RemoveItem | Remove a contour setting item from the current contour setting. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace